Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElement Property
 Can't keep reference of joined element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotKeepReferenceOfJoinedElement { get; }
Public Shared ReadOnly Property CannotKeepReferenceOfJoinedElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotKeepReferenceOfJoinedElement {
	FailureDefinitionId^ get ();
}
static member CannotKeepReferenceOfJoinedElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace